# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.

# TODO: your code here
sum = 0
random_number = [5, 5, 5]
for el in random_number:
    sum = el + sum
print(sum)
